walopes/STM32_UART_SPL/CoX_Driver/GPS_NEO_6M/DrvGps_NEO_6M.h
/**********************************************************************
 * 文件名称：DrvGps_NEO_6M.h
 * 文件说明：提供对ublox NEO 6M GPS模块的数据分析与gps信息解码
 * |  创建时间      | 版本信息   |     创建人          |    联系方式                                |
 *  2013-11-01     0.0.1      ShawnFeng         FML927@163.com
**********************************************************************/

#ifndef _DrvGps_NEO_6M_h_
#define _DrvGps_NEO_6M_h_	 

#include "stm32f0xx.h"

typedef   unsigned char     u8;
typedef   signed   char     s8;
typedef  unsigned short int u16;
typedef  signed   short int s16;
//typedef  unsigned long  int u32;
//typedef  signed   long  int s32;

typedef  float f32;


//GPS NMEA-0183协议重要参数结构体定义 
//卫星信息
typedef struct  
{										    
 	u8 num;		//卫星编号
	u8 eledeg;	//卫星仰角
	u16 azideg;	//卫星方位角
	u8 sn;		//信噪比		   
}Gps_slmsg;  
//UTC时间信息
typedef struct  
{										    
 	u16 year;	//年份
	u8 month;	//月份
	u8 date;	//日期
	u8 hour; 	//小时
	u8 min; 	//分钟
	u8 sec; 	//秒钟
}Gps_utc_time;   	   
//NMEA 0183 协议解析后数据存放结构体
typedef struct  
{										    
 	u8 svnum;					//可见卫星数
	Gps_slmsg slmsg[12];		//最多12颗卫星
	Gps_utc_time utc;			//UTC时间
	u32 latitude;				//纬度 分扩大100000倍,实际要除以100000
	u8 nshemi;					//北纬/南纬,N:北纬;S:南纬				  
	u32 longitude;			    //经度 分扩大100000倍,实际要除以100000
	u8 ewhemi;					//东经/西经,E:东经;W:西经
	u8 gpssta;					//GPS状态:0,未定位;1,非差分定位;2,差分定位;6,正在估算.				  
 	u8 posslnum;				//用于定位的卫星数,0~12.
 	u8 possl[12];				//用于定位的卫星编号
	u8 fixmode;					//定位类型:1,没有定位;2,2D定位;3,3D定位
	u16 pdop;					//位置精度因子 0~500,对应实际值0~50.0
	u16 hdop;					//水平精度因子 0~500,对应实际值0~50.0
	u16 vdop;					//垂直精度因子 0~500,对应实际值0~50.0 

	int altitude;			 	//海拔高度,放大了10倍,实际除以10.单位:0.1m	 
	u16 speed;					//地面速率,放大了1000倍,实际除以10.单位:0.001公里/小时	 
}Gps_msg; 


//////////////////////////////////////////////////////////////////////////////////////////////////// 	
//UBLOX NEO-6M 时钟脉冲配置结构体
typedef struct
{										    
 	u16 header;					//cfg header,固定为0X62B5(小端模式)
	u16 id;						//CFG TP ID:0X0706 (小端模式)
	u16 dlength;				//数据长度
	u32 interval;				//时钟脉冲间隔,单位为us
	u32 length;				 	//脉冲宽度,单位为us
	signed char status;			//时钟脉冲配置:1,高电平有效;0,关闭;-1,低电平有效.			  
	u8 timeref;			   		//参考时间:0,UTC时间;1,GPS时间;2,当地时间.
	u8 flags;					//时间脉冲设置标志
	u8 reserved;				//保留			  
 	signed short antdelay;	 	//天线延时
 	signed short rfdelay;		//RF延时
	signed int userdelay; 	 	//用户延时	
	u8 cka;						//校验CK_A 							 	 
	u8 ckb;						//校验CK_B							 	 
}_ublox_cfg_tp; 


//UBLOX NEO-6M 刷新速率配置结构体
 typedef struct
{										    
 	u16 header;					//cfg header,固定为0X62B5(小端模式)
	u16 id;						//CFG RATE ID:0X0806 (小端模式)
	u16 dlength;				//数据长度
	u16 measrate;				//测量时间间隔，单位为ms，最少不能小于200ms（5Hz）
	u16 navrate;				//导航速率（周期），固定为1
	u16 timeref;				//参考时间：0=UTC Time；1=GPS Time；
 	u8 cka;						//校验CK_A 							 	 
	u8 ckb;						//校验CK_B							 	 
}_ublox_cfg_rate; 
				 
/**************************   外部接口函数   ****************************/
/**********************************************************************
 * 函数名称：GPS_Analysis
 * 函数说明：根据输入缓冲区的信息解码得到有效的gps信息
 *          结果存入结构体指针对应的结构体buffer
 * 参数说明：gpsx:  nmea信息结构体
 *			buf:   接收到的GPS数据缓冲区首地址
 * 返回值     ：无
 * 错误信息：无
**********************************************************************/
void GPS_Analysis(Gps_msg *gpsx,u8 *buf);
/**********************************************************************
 * 函数名称：Ublox_Cfg_Tp
 * 函数说明：配置UBLOX NEO-6的时钟脉冲输出
 * 参数说明：interval:脉冲间隔
 *          length:脉冲宽度
 *          status:脉冲配置:1,高电平有效;0,关闭;-1,低电平有效.
 * 返回值     ：无
 * 错误信息：无
**********************************************************************/
void Ublox_Cfg_Tp(u32 interval,u32 length,signed char status);
/**********************************************************************
 * 函数名称：UBLOX_Cfg_Rate
 * 函数说明：配置UBLOX NEO-6的刷新速率
 * 参数说明：u32 measrate 测量时间间隔，单位为ms，最少不能小于200ms（5Hz）
 *          u8 reftime   参考时间，0=UTC Time；1=GPS Time（一般设置为1）
 * 返回值     ：错误信息
 * 错误信息：-1 设置参考时间小于200ms
**********************************************************************/
int UBLOX_Cfg_Rate(u32 measrate, u8 reftime);




#endif  

 





